app/views/homepage/index.html.erb

SELECT "matches".* FROM "matches" ORDER BY created_at DESC
---
<div class="card-container">
  <% Match.all.each_with_index do |match,index|%>