app/views/homepage/index.html.erb

SELECT "players".* FROM "players" ORDER BY total_win DESC, points ASC
SELECT SUM("players"."total_win") FROM "players"
---

<h1 class="mb-4 text-4xl font-extrabold leading-none tracking-tight text-gray-900 md:text-5xl lg:text-6xl dark:text-white"> There are  <span class="text-blue-600 dark:text-blue-500"># <%= Player.all.sum("total_win")%></span> Fights.</h1>