app/views/user_mailer/send_match.html.erb

SELECT "players".* FROM "players"
---
      <tbody>
        <% Player.all.each_with_index do |player,index| %>