app/controllers/homepage_controller.rb

SELECT "players".* FROM "players" ORDER BY "players"."total_win" DESC, "players"."points" DESC
SELECT SUM("players"."total_win") FROM "players"
---
  def index
    @players = Player.order(total_win: :desc, points: :desc)