app/controllers/matches_controller.rb

SELECT "players".* FROM "players"
---
  def new
    @match = Match.new
    @players = Player.all

SELECT "players".* FROM "players"
---
  def edit
    @players = Player.all

INSERT INTO "matches" ("winner_id", "runner_up_id", "second_runner_up_id", "last_id", "created_at", "updated_at") VALUES (1, 2, 3, 2, '2025-10-03 09:35:24.384035', '2025-10-03 09:35:24.384035') RETURNING "id"
SELECT "players".* FROM "players" WHERE "players"."id" = 1 LIMIT 1
UPDATE "players" SET "total_win" = COALESCE("total_win", 0) + 1 WHERE "players"."id" = 1
UPDATE "players" SET "points" = COALESCE("points", 0) + 4 WHERE "players"."id" = 1
UPDATE "players" SET "points" = COALESCE("points", 0) + 2 WHERE "players"."id" = 1
UPDATE "players" SET "points" = COALESCE("points", 0) + 1 WHERE "players"."id" = 1
---
def create
  @match = Match.new(match_params)

  respond_to do |format|
    if @match.save
      # update winner
      UserMailer.with(match: @match).send_match.deliver_now

      winner = Player.find(@match.winner_id)
      winner.increment!(:total_win)
      winner.increment!(:points, 4)

      # update runner up
      runner_up = Player.find(@match.runner_up_id)
      runner_up.increment!(:points, 2)

      # update second runner up
      second_runner_up = Player.find(@match.second_runner_up_id)
      second_runner_up.increment!(:points, 1)

      # last place (no points, but you could track losses if you add that field)
      last_player = Player.find(@match.last_id)

SELECT "players".* FROM "players" WHERE "players"."id" = 1 LIMIT 1
UPDATE "players" SET "points" = COALESCE("points", 0) - 4 WHERE "players"."id" = 1
DELETE FROM "matches" WHERE "matches"."id" = 21
---
def destroy
  # rollback player stats before destroying match
  winner = Player.find(@match.winner_id)
  winner.decrement!(:total_win)
  winner.decrement!(:points, 4)

  runner_up = Player.find(@match.runner_up_id)
  runner_up.decrement!(:points, 2)

  second_runner_up = Player.find(@match.second_runner_up_id)
  second_runner_up.decrement!(:points, 1)

  last_player = Player.find(@match.last_id)
  # last_player.decrement!(:losses) if you add a losses column later

  @match.destroy!

SELECT "matches".* FROM "matches" WHERE "matches"."id" = 21 LIMIT 1
---
    def set_match
      @match = Match.find(params.require(:id))