app/controllers/matches_controller.rb

def destroy
  @match.destroy!
---
DELETE FROM "matches" WHERE "matches"."id" = 21

    def set_match
      @match = Match.find(params.require(:id))
---
SELECT "matches".* FROM "matches" WHERE "matches"."id" = 21 LIMIT 1