app/controllers/players_controller.rb

INSERT INTO "players" ("name", "total_win", "points", "created_at", "updated_at") VALUES ('Naveen', 0, 0, '2025-10-03 09:25:47.227134', '2025-10-03 09:25:47.227134') RETURNING "id"
---
  def create
    @player = Player.new(player_params)

    respond_to do |format|
      if @player.save

SELECT "players".* FROM "players" WHERE "players"."id" = 1 LIMIT 1
---
    def set_player
      @player = Player.find(params.expect(:id))